namespace ZhouYi
{
    public class GuaXiang
    {
        /// <summary>
        /// 获取象名称 1表示-- 0表示—
        /// </summary>
        /// <param name="c"></param>
        /// <returns></returns>
        public static string GetXiangName(string c)
        {
            switch (c)
            {
                case "000":
                    return "乾";
                case "001":
                    return "巽";
                case "010":
                    return "离";
                case "011":
                    return "艮";
                case "100":
                    return "兑";
                case "101":
                    return "坎";
                case "110":
                    return "震";
                case "111":
                    return "坤";
                default:
                    return "";
            }
        }
        /// <summary>
        /// 获取卦象名称
        /// </summary>
        /// <param name="s"></param>
        /// <returns></returns>
        public static string GetGuaName(string s)
        {
            switch (s)
            {
                case "000000"://乾乾
                    return "乾卦";
                case "000001"://乾巽
                    return "姤卦";
                case "000010"://乾离
                    return "同人卦";
                case "000011"://乾艮
                    return "遁卦";
                case "000100"://乾兑
                    return "履卦";
                case "000101"://乾坎
                    return "讼卦";
                case "000110"://乾震
                    return "无妄卦";
                case "000111"://乾坤
                    return "否卦";
                case "001000"://巽乾
                    return "小畜卦";
                case "001001"://巽巽
                    return "巽卦";
                case "001010"://巽离
                    return "家人卦";
                case "001011"://巽艮
                    return "渐卦";
                case "001100"://巽兑
                    return "中孚卦";
                case "001101"://巽坎
                    return "涣卦";
                case "001110"://巽震
                    return "益卦";
                case "001111"://巽坤
                    return "观卦";
                case "010000"://离乾
                    return "大有卦";
                case "010001"://离巽
                    return "鼎卦";
                case "010010"://离离
                    return "离卦";
                case "010011"://离艮
                    return "旅卦";
                case "010100"://离兑
                    return "睽卦";
                case "010101"://离坎
                    return "未济卦";
                case "010110"://离震
                    return "噬嗑卦";
                case "010111"://离坤
                    return "晋卦";
                case "011000"://艮乾
                    return "大畜卦";
                case "011001"://艮巽
                    return "蛊卦";
                case "011010"://艮离
                    return "贲卦";
                case "011011"://艮艮
                    return "艮卦";
                case "011100"://艮兑
                    return "损卦";
                case "011101"://艮坎
                    return "蒙卦";
                case "011110"://艮震
                    return "颐卦";
                case "011111"://艮坤
                    return "剥卦";
                case "100000"://兑乾
                    return "夬挂";
                case "100001"://兑巽
                    return "大过卦";
                case "100010"://兑离
                    return "革卦";
                case "100011"://兑艮
                    return "咸卦";
                case "100100"://兑兑
                    return "兑卦";
                case "100101"://兑坎
                    return "困卦";
                case "100110"://兑震
                    return "随卦";
                case "100111"://兑坤
                    return "萃卦";
                case "101000"://坎乾
                    return "需卦";
                case "101001"://坎巽
                    return "井卦";
                case "101010"://坎离
                    return "既济卦";
                case "101011"://坎艮
                    return "蹇卦";
                case "101100"://坎兑
                    return "节卦";
                case "101101"://坎坎
                    return "坎卦";
                case "101110"://坎震
                    return "屯卦";
                case "101111"://坎坤
                    return "比卦";
                case "110000"://震乾
                    return "大壮卦";
                case "110001"://震巽
                    return "恒卦";
                case "110010"://震离
                    return "丰卦";
                case "110011"://震艮
                    return "小过卦";
                case "110100"://震兑
                    return "归妹卦";
                case "110101"://震坎
                    return "解卦";
                case "110110"://震震
                    return "震卦";
                case "110111"://震坤
                    return "豫卦";
                case "111000"://坤乾
                    return "泰卦";
                case "111001"://坤巽
                    return "升卦";
                case "111010"://坤离
                    return "明夷卦";
                case "111011"://坤艮
                    return "谦卦";
                case "111100"://坤兑
                    return "临卦";
                case "111101"://坤坎
                    return "师卦";
                case "111110"://坤震
                    return "复卦";
                case "111111"://坤坤
                    return "坤卦";
                default:
                    return "";
            }
        }
        /// <summary>
        /// 获取爻辞
        /// </summary>
        /// <param name="s"></param>
        /// <returns></returns>
        public static string GetGuaCi(string s)
        {
            switch (s)
            {
                case "0000001"://乾卦 第1条爻辞
                    return "初九，潜龙勿用。";
                case "0000002"://乾卦 第2条爻辞
                    return "九二，见龙在田，利见大人。";
                case "0000003"://乾卦 第3条爻辞
                    return "九三，君子终日乾乾，夕惕若，厉无咎。";
                case "0000004"://乾卦 第4条爻辞
                    return "九四，或跃在渊，无咎。";
                case "0000005"://乾卦 第5条爻辞
                    return "九五，飞龙在天，利见大人。";
                case "0000006"://乾卦 第6条爻辞
                    return "上九，亢龙有悔。";
                case "0000000"://乾卦 卦辞
                    return "元，亨，利，贞。";
                case "0000011"://姤卦 第1条爻辞
                    return "初六，系于金柅，贞吉；有攸往，见凶，羸豕孚蹢躅。";
                case "0000012"://姤卦 第2条爻辞
                    return "九二，包有鱼，无咎；不利宾。";
                case "0000013"://姤卦 第3条爻辞
                    return "九三，臀无肤，其行次且；厉，无大咎。";
                case "0000014"://姤卦 第4条爻辞
                    return "九四，包无鱼，起凶。";
                case "0000015"://姤卦 第5条爻辞
                    return "九五，以杞包瓜；含章，有陨自天。";
                case "0000016"://姤卦 第6条爻辞
                    return "上九，姤其角；吝，无咎。";
                case "0000010"://姤卦 卦辞
                    return "女壮，勿用取女。";
                case "0000101"://同人卦 第1条爻辞
                    return "初九，同人于门，无咎。";
                case "0000102"://同人卦 第2条爻辞
                    return "六二，同人于宗，吝。";
                case "0000103"://同人卦 第3条爻辞
                    return "九三，伏戎于莽，升其高陵，三岁不兴。";
                case "0000104"://同人卦 第4条爻辞
                    return "九四，乘其墉，弗克攻，吉。";
                case "0000105"://同人卦 第5条爻辞
                    return "九五，同人，先号啕，而后笑，大师克相遇。";
                case "0000106"://同人卦 第6条爻辞
                    return "上九，同人于郊，无悔。";
                case "0000100"://同人卦 卦辞
                    return "同人于野，亨，利涉大川，利君子贞。";
                case "0000111"://遁卦 第1条爻辞
                    return "上九：肥遯，无不利。";
                case "0000112"://遁卦 第2条爻辞
                    return "九五：嘉遯，贞吉。";
                case "0000113"://遁卦 第3条爻辞
                    return "九四：好遯，君子吉，小人否。";
                case "0000114"://遁卦 第4条爻辞
                    return "九三：系遯，有疾厉；畜臣妾，吉。";
                case "0000115"://遁卦 第5条爻辞
                    return "六二：执之用黄牛之革，莫之胜说。";
                case "0000116"://遁卦 第6条爻辞
                    return "初六：尾，厉，勿用有攸往。";
                case "0000110"://遁卦 卦辞
                    return "亨，小利贞。";
                case "0001001"://履卦 第1条爻辞
                    return "初九，素履，往无咎。";
                case "0001002"://履卦 第2条爻辞
                    return "九二，履道坦坦，幽人贞吉。";
                case "0001003"://履卦 第3条爻辞
                    return "六三，眇能视，跛能履，履虎尾咥人，凶；武人为于大君。";
                case "0001004"://履卦 第4条爻辞
                    return "九四，履虎尾，愬愬，终吉。";
                case "0001005"://履卦 第5条爻辞
                    return "九五，夬履，贞厉。";
                case "0001006"://履卦 第6条爻辞
                    return "上九，视履考祥，其旋元吉。";
                case "0001000"://履卦 卦辞
                    return "虎尾不真，人亨。";
                case "0001011"://讼卦 第1条爻辞
                    return "初六，不永所事，小有言，终吉。";
                case "0001012"://讼卦 第2条爻辞
                    return "九二，不克讼，归而逋；其邑人三百户，无眚。";
                case "0001013"://讼卦 第3条爻辞
                    return "六三，食旧德，贞厉，终吉；或从王事，无成。";
                case "0001014"://讼卦 第4条爻辞
                    return "九四，不克讼，复即命；渝，安贞吉。";
                case "0001015"://讼卦 第5条爻辞
                    return "九五，讼，元吉。";
                case "0001016"://讼卦 第6条爻辞
                    return "上九，或锡之鞶带，终朝三褫之。";
                case "0001010"://讼卦 卦辞
                    return "有孚，窒惕。中吉；终凶。利见大人；不利涉大川。";
                case "0001101"://无妄卦 第1条爻辞
                    return "初九：无妄，往吉。";
                case "0001102"://无妄卦 第2条爻辞
                    return "六二：不耕获，不菑畲，则利有攸往。";
                case "0001103"://无妄卦 第3条爻辞
                    return "六三：无妄之灾，或系之牛，行人之得，邑人之灾。";
                case "0001104"://无妄卦 第4条爻辞
                    return "九四：可贞，无咎。";
                case "0001105"://无妄卦 第5条爻辞
                    return "九五：无妄之疾，勿药有喜。";
                case "0001106"://无妄卦 第6条爻辞
                    return "上九：无妄，行有眚，无攸利。";
                case "0001100"://无妄卦 卦辞
                    return "元，亨，利，贞。 其匪正有眚，不利有攸往。";
                case "0001111"://否卦 第1条爻辞
                    return "初六，拔茅茹，以其汇，贞吉，亨。";
                case "0001112"://否卦 第2条爻辞
                    return "六二，包承，小人吉；大人否，亨。";
                case "0001113"://否卦 第3条爻辞
                    return "六三，包羞。";
                case "0001114"://否卦 第4条爻辞
                    return "九四，有命无咎，畴离祉。";
                case "0001115"://否卦 第5条爻辞
                    return "九五，休否，大人吉；其亡其亡，系于苞桑。";
                case "0001116"://否卦 第6条爻辞
                    return "上九，倾否；先否后喜。";
                case "0001110"://否卦 卦辞
                    return "否之匪人，不利君子贞，大往小来。";
                case "0010001"://小畜卦 第1条爻辞
                    return "初九，复自道，何其咎？吉。";
                case "0010002"://小畜卦 第2条爻辞
                    return "九二，牵复，吉。";
                case "0010003"://小畜卦 第3条爻辞
                    return "九三，舆说辐，夫妻反目。";
                case "0010004"://小畜卦 第4条爻辞
                    return "六四，有孚，血去惕出，无咎。";
                case "0010005"://小畜卦 第5条爻辞
                    return "九五，有孚挛如，富以其邻。";
                case "0010006"://小畜卦 第6条爻辞
                    return "上九，既雨既处，尚德载。妇贞厉，月几望。君子征凶。";
                case "0010000"://小畜卦 卦辞
                    return "亨。密云不雨，自我西郊。";
                case "0010011"://巽卦 第1条爻辞
                    return "初六，进退，利武人之贞。";
                case "0010012"://巽卦 第2条爻辞
                    return "九二，巽在床下，用史、巫纷若；吉，无咎。";
                case "0010013"://巽卦 第3条爻辞
                    return "九三，频巽，吝。";
                case "0010014"://巽卦 第4条爻辞
                    return "六四，悔亡，田获三品。";
                case "0010015"://巽卦 第5条爻辞
                    return "九五，贞吉，悔亡，无不利。无初有终。先庚三日，后庚三日，吉。";
                case "0010016"://巽卦 第6条爻辞
                    return "上九，巽在床下，丧其资斧，贞凶。";
                case "0010010"://巽卦 卦辞
                    return "小亨；利有攸往；利见大人。";
                case "0010101"://家人卦 第1条爻辞
                    return "初九，闲有家，悔亡。";
                case "0010102"://家人卦 第2条爻辞
                    return "六二，无攸遂，在中馈，贞吉。";
                case "0010103"://家人卦 第3条爻辞
                    return "九三，家人嗃嗃，悔厉，吉；妇子嘻嘻，终吝";
                case "0010104"://家人卦 第4条爻辞
                    return "六四，富家，大吉";
                case "0010105"://家人卦 第5条爻辞
                    return "九五，王假有家，勿恤，吉。";
                case "0010106"://家人卦 第6条爻辞
                    return "上九，有孚，威如，终吉。";
                case "0010100"://家人卦 卦辞
                    return "利女贞。";
                case "0010111"://渐卦 第1条爻辞
                    return "初六，鸿渐于干，小子厉；有言，无咎。";
                case "0010112"://渐卦 第2条爻辞
                    return "六二，鸿渐于磐，饮食衎衎，吉。";
                case "0010113"://渐卦 第3条爻辞
                    return "九三，鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。";
                case "0010114"://渐卦 第4条爻辞
                    return "六四，鸿渐于木，或得其桷，无咎。";
                case "0010115"://渐卦 第5条爻辞
                    return "九五，鸿渐于陵，妇三岁不孕；终莫之胜，吉。";
                case "0010116"://渐卦 第6条爻辞
                    return "上九，鸿渐于陆，其羽可用为仪，吉。";
                case "0010110"://渐卦 卦辞
                    return "女归，吉，利贞。";
                case "0011001"://中孚卦 第1条爻辞
                    return "初九，虞吉，有它不燕。";
                case "0011002"://中孚卦 第2条爻辞
                    return "九二，鹤鸣在阴，其子和之；我有好爵，吾与尔靡之。";
                case "0011003"://中孚卦 第3条爻辞
                    return "六三，得敌，或鼓或罢，或泣或歌。";
                case "0011004"://中孚卦 第4条爻辞
                    return "六四，月几望，马匹亡，无咎。";
                case "0011005"://中孚卦 第5条爻辞
                    return "九五，有孚挛如，无咎。";
                case "0011006"://中孚卦 第6条爻辞
                    return "上九，翰音登于天，贞凶。";
                case "0011000"://中孚卦 卦辞
                    return "豚鱼吉，利涉大川，利贞。";
                case "0011011"://涣卦 第1条爻辞
                    return "初六，用拯马壮，吉。";
                case "0011012"://涣卦 第2条爻辞
                    return "九二，涣奔其机，悔亡。";
                case "0011013"://涣卦 第3条爻辞
                    return "六三，涣其躬，无悔。";
                case "0011014"://涣卦 第4条爻辞
                    return "六四，涣其群，元吉；涣有丘，匪夷所思。";
                case "0011015"://涣卦 第5条爻辞
                    return "九五，涣汗其大号，涣王居，无咎。";
                case "0011016"://涣卦 第6条爻辞
                    return "上九，涣其血去逖出，无咎。";
                case "0011010"://涣卦 卦辞
                    return "亨。王假有庙，利涉大川，利贞。";
                case "0011101"://益卦 第1条爻辞
                    return "初九：利用为大作，元吉，无咎。";
                case "0011102"://益卦 第2条爻辞
                    return "六二：或益之十傰之龟，弗亨回，永贞吉，王用芳于帝，吉。";
                case "0011103"://益卦 第3条爻辞
                    return "六三：益之用工事，无咎，有复中行，告公用闺。";
                case "0011104"://益卦 第4条爻辞
                    return "六四：中行，告公，从，利用为依迁国。";
                case "0011105"://益卦 第5条爻辞
                    return "九五：有复惠心，勿问，元吉，有复惠我德。";
                case "0011106"://益卦 第6条爻辞
                    return "尚九：莫益之，或击之，立心勿恒，凶。";
                case "0011100"://益卦 卦辞
                    return "利用攸往，利涉大川。";
                case "0011111"://观卦 第1条爻辞
                    return "初六，童观，小人无咎，君子吝。";
                case "0011112"://观卦 第2条爻辞
                    return "六二，闚观，利女贞。";
                case "0011113"://观卦 第3条爻辞
                    return "六三，观我生，进退。";
                case "0011114"://观卦 第4条爻辞
                    return "六四，观国之光，利用宾于王。";
                case "0011115"://观卦 第5条爻辞
                    return "九五，观我生，君子无咎。";
                case "0011116"://观卦 第6条爻辞
                    return "上九，观其生，君子无咎。";
                case "0011110"://观卦 卦辞
                    return "盥而不荐，有孚顒若。";
                case "0100001"://大有卦 第1条爻辞
                    return "初九，无交害，匪咎；艰者无咎。";
                case "0100002"://大有卦 第2条爻辞
                    return "九二，大车以载，有攸往，无咎。";
                case "0100003"://大有卦 第3条爻辞
                    return "九三，公用亨于天子，小人弗克。";
                case "0100004"://大有卦 第4条爻辞
                    return "九四，匪其彭，无咎。";
                case "0100005"://大有卦 第5条爻辞
                    return "六五，厥孚交加，威加，吉。";
                case "0100006"://大有卦 第6条爻辞
                    return "上九，自天佑之，吉无不利。";
                case "0100000"://大有卦 卦辞
                    return "乾下离上 大有元亨";
                case "0100011"://鼎卦 第1条爻辞
                    return "初六，鼎颠趾，利出否；得妾以其子，无咎。";
                case "0100012"://鼎卦 第2条爻辞
                    return "九二，鼎有实，我仇有疾；不我能即，吉。";
                case "0100013"://鼎卦 第3条爻辞
                    return "九三，鼎耳革，其行塞；雉膏不食，方雨亏。悔，终吉。";
                case "0100014"://鼎卦 第4条爻辞
                    return "九四，鼎折足，覆公餗，其形渥，凶。";
                case "0100015"://鼎卦 第5条爻辞
                    return "六五，鼎黄耳金铉，利贞。";
                case "0100016"://鼎卦 第6条爻辞
                    return "上九，鼎玉铉，大吉，无不利。";
                case "0100010"://鼎卦 卦辞
                    return "元吉，亨。";
                case "0100101"://离卦 第1条爻辞
                    return "初九，礼昔然敬之，无咎。";
                case "0100102"://离卦 第2条爻辞
                    return "六二，黄罗，元吉。";
                case "0100103"://离卦 第3条爻辞
                    return "九三，日昃之离，不鼓珤而歌，即大绖之嗟，凶。";
                case "0100104"://离卦 第4条爻辞
                    return "九四，出如、来如、纷如、死如、弃如。";
                case "0100105"://离卦 第5条爻辞
                    return "六五，出涕沱若，戚嗟若，吉。";
                case "0100106"://离卦 第6条爻辞
                    return "上九，王用出征，有嘉。折首，获匪其丑，无咎。";
                case "0100100"://离卦 卦辞
                    return "利贞，亨。畜牝牛，吉。";
                case "0100111"://旅卦 第1条爻辞
                    return "初六，旅琐琐，斯其所取灾。";
                case "0100112"://旅卦 第2条爻辞
                    return "六二，旅即次，怀其资，得童仆，贞。";
                case "0100113"://旅卦 第3条爻辞
                    return "九三，旅焚其次，丧其童仆；贞厉。";
                case "0100114"://旅卦 第4条爻辞
                    return "九四，旅于处，得其资斧，我心不快。";
                case "0100115"://旅卦 第5条爻辞
                    return "六五，射雉，一矢亡；终以誉命。";
                case "0100116"://旅卦 第6条爻辞
                    return "上九，鸟焚其巢，旅人先笑，后号咷；丧牛于易，凶。";
                case "0100110"://旅卦 卦辞
                    return "旅，小亨，旅贞吉。";
                case "0101001"://睽卦 第1条爻辞
                    return "初九，悔亡；丧马，勿逐自复；见恶人，无咎。";
                case "0101002"://睽卦 第2条爻辞
                    return "九二，遇主于巷，无咎。";
                case "0101003"://睽卦 第3条爻辞
                    return "六三，见舆曳，其牛掣；其人天且劓。无初有终。";
                case "0101004"://睽卦 第4条爻辞
                    return "九四，睽孤；遇元夫，交孚，厉无咎。";
                case "0101005"://睽卦 第5条爻辞
                    return "六五，悔亡，厥宗噬肤，往何咎？";
                case "0101006"://睽卦 第6条爻辞
                    return "上九，睽孤，见豕负塗，载鬼一车，先张之弧，后说之弧；匪寇，婚媾；往遇雨则吉。";
                case "0101000"://睽卦 卦辞
                    return "睽，小事吉。";
                case "0101011"://未济卦 第1条爻辞
                    return "初六，濡其尾，吝。";
                case "0101012"://未济卦 第2条爻辞
                    return "九二，曳其轮，贞吉。";
                case "0101013"://未济卦 第3条爻辞
                    return "六三，未济，征凶，利涉大川。";
                case "0101014"://未济卦 第4条爻辞
                    return "九四，贞吉，悔亡；震用伐鬼方，三年有赏于大国。";
                case "0101015"://未济卦 第5条爻辞
                    return "六五，贞吉，无悔；君子之光，有孚吉。";
                case "0101016"://未济卦 第6条爻辞
                    return "上九，有孚于饮酒，无咎；濡其首，有孚失是。";
                case "0101010"://未济卦 卦辞
                    return "未济，亨；小狐汔济，濡其尾，无攸利。";
                case "0101101"://噬嗑卦 第1条爻辞
                    return "初九，屦校灭趾，无咎。";
                case "0101102"://噬嗑卦 第2条爻辞
                    return "六二，噬肤灭鼻，无咎。";
                case "0101103"://噬嗑卦 第3条爻辞
                    return "六三，噬腊肉，遇毒；小吝，无咎。";
                case "0101104"://噬嗑卦 第4条爻辞
                    return "九四，噬乾胏，得金矢，利艰贞，吉。";
                case "0101105"://噬嗑卦 第5条爻辞
                    return "六五，噬乾肉，得黄金；贞厉，无咎。";
                case "0101106"://噬嗑卦 第6条爻辞
                    return "上九，何校灭耳，凶。";
                case "0101100"://噬嗑卦 卦辞
                    return "噬嗑，亨，利用狱。";
                case "0101111"://晋卦 第1条爻辞
                    return "初六，晋如，摧如，贞吉；罔孚，裕无咎。";
                case "0101112"://晋卦 第2条爻辞
                    return "六二，晋如愁如，贞吉；受兹介福，于其王母。";
                case "0101113"://晋卦 第3条爻辞
                    return "六三，众允，悔亡。";
                case "0101114"://晋卦 第4条爻辞
                    return "九四，晋如鼫鼠，贞厉。";
                case "0101115"://晋卦 第5条爻辞
                    return "六五，悔亡，失得勿恤。往，吉。无不利。";
                case "0101116"://晋卦 第6条爻辞
                    return "上九，晋其角，维用伐邑，厉吉，无咎，贞吝。";
                case "0101110"://晋卦 卦辞
                    return "晋，康侯用锡马蕃庶，昼日三接。";
                case "0110001"://大畜卦 第1条爻辞
                    return "初九，有厉，利已。";
                case "0110002"://大畜卦 第2条爻辞
                    return "九二，舆说輹。";
                case "0110003"://大畜卦 第3条爻辞
                    return "九三，良马逐，利艰贞，日闲舆卫，利有攸往。";
                case "0110004"://大畜卦 第4条爻辞
                    return "六四，童牛之牿，元吉。";
                case "0110005"://大畜卦 第5条爻辞
                    return "六五，豶豕之牙，吉。";
                case "0110006"://大畜卦 第6条爻辞
                    return "上九，何天之衢，亨。";
                case "0110000"://大畜卦 卦辞
                    return "大畜，利贞。不家食、吉。利涉大川。";
                case "0110011"://蛊卦 第1条爻辞
                    return "初六，干父之蛊，有子考，无咎，厉终吉。";
                case "0110012"://蛊卦 第2条爻辞
                    return "九二，干母之蛊，不可贞。";
                case "0110013"://蛊卦 第3条爻辞
                    return "九三，干父之蛊，小有悔，无大咎。";
                case "0110014"://蛊卦 第4条爻辞
                    return "六四，裕父之蛊，往见吝。";
                case "0110015"://蛊卦 第5条爻辞
                    return "六五，干父之蛊，用誉。";
                case "0110016"://蛊卦 第6条爻辞
                    return "上九，不事王侯，高尚其事。";
                case "0110010"://蛊卦 卦辞
                    return "蛊，元亨，利涉大川；先甲三日，后甲三日。";
                case "0110101"://贲卦 第1条爻辞
                    return "初九，贲其趾，舍车而徒。";
                case "0110102"://贲卦 第2条爻辞
                    return "六二，贲其须。";
                case "0110103"://贲卦 第3条爻辞
                    return "九三，贲如濡如。永贞吉。";
                case "0110104"://贲卦 第4条爻辞
                    return "六四，贲如皤如。白马翰如。匪寇，婚媾。";
                case "0110105"://贲卦 第5条爻辞
                    return "六五，贲于丘园，束帛戋戋。吝，终吉。";
                case "0110106"://贲卦 第6条爻辞
                    return "上九，白贲，无咎。";
                case "0110100"://贲卦 卦辞
                    return "贲。亨。小利有攸往。";
                case "0110111"://艮卦 第1条爻辞
                    return "初六，艮其趾，无咎；利永贞。";
                case "0110112"://艮卦 第2条爻辞
                    return "六二，艮其腓，不拯其随；其心不快。";
                case "0110113"://艮卦 第3条爻辞
                    return "九三，艮其限，列其夤；厉，薰心。";
                case "0110114"://艮卦 第4条爻辞
                    return "六四，艮其身，无咎。";
                case "0110115"://艮卦 第5条爻辞
                    return "六五，艮其辅，言有序，悔亡。";
                case "0110116"://艮卦 第6条爻辞
                    return "上九，敦艮，吉。";
                case "0110110"://艮卦 卦辞
                    return "艮，艮其背，不获其身；行其庭，不见其人，无咎。";
                case "0111001"://损卦 第1条爻辞
                    return "初九，祀事遄往，无咎，酌损之。";
                case "0111002"://损卦 第2条爻辞
                    return "九二，利贞，征凶，弗损益之。";
                case "0111003"://损卦 第3条爻辞
                    return "六三，三人行，则损一人。一人行，则得其友。";
                case "0111004"://损卦 第4条爻辞
                    return "六四，损其疾，使遄有喜，无咎。";
                case "0111005"://损卦 第5条爻辞
                    return "六五，或益之十朋之龟，弗克违，元吉。";
                case "0111006"://损卦 第6条爻辞
                    return "上九，弗损益之，无咎，贞吉。 利有攸往，得臣无家。";
                case "0111000"://损卦 卦辞
                    return "损，有孚，元吉，无咎，可贞；利有攸往。曷之用？二簋可用享。";
                case "0111011"://蒙卦 第1条爻辞
                    return "初六，发蒙，利用刑人，用说桎梏；以往吝。";
                case "0111012"://蒙卦 第2条爻辞
                    return "九二，包蒙，吉。纳妇，吉；子克家。";
                case "0111013"://蒙卦 第3条爻辞
                    return "六三，勿用取女，见金夫，不有躬，无攸利。";
                case "0111014"://蒙卦 第4条爻辞
                    return "六四，困蒙，吝。";
                case "0111015"://蒙卦 第5条爻辞
                    return "六五，童蒙，吉。";
                case "0111016"://蒙卦 第6条爻辞
                    return "上九，击蒙，不利为寇，利御寇。";
                case "0111010"://蒙卦 卦辞
                    return "蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。";
                case "0111101"://颐卦 第1条爻辞
                    return "初九，舍尔灵龟，观我朵颐，凶。";
                case "0111102"://颐卦 第2条爻辞
                    return "六二，颠颐，拂经；于丘颐，征凶。";
                case "0111103"://颐卦 第3条爻辞
                    return "六三，拂颐，贞凶；十年勿用，无攸利。";
                case "0111104"://颐卦 第4条爻辞
                    return "六四，颠颐，吉；虎视眈眈，其欲逐逐，无咎。";
                case "0111105"://颐卦 第5条爻辞
                    return "六五，拂经，居贞吉，不可涉大川。";
                case "0111106"://颐卦 第6条爻辞
                    return "上九，由颐，厉吉，利涉大川。";
                case "0111100"://颐卦 卦辞
                    return "颐，贞吉。观颐，自求口实。";
                case "0111111"://剥卦 第1条爻辞
                    return "初六，剥床以足，蔑，贞凶。";
                case "0111112"://剥卦 第2条爻辞
                    return "六二，剥床以辨，蔑，贞凶。";
                case "0111113"://剥卦 第3条爻辞
                    return "六三，剥，无咎。";
                case "0111114"://剥卦 第4条爻辞
                    return "六四，剥床以肤，凶。";
                case "0111115"://剥卦 第5条爻辞
                    return "六五，贯鱼，以宫人宠，无不利。";
                case "0111116"://剥卦 第6条爻辞
                    return "上九，硕果不食，君子得舆，小人剥庐。";
                case "0111110"://剥卦 卦辞
                    return "剥，不利有攸往。";
                case "1000001"://夬卦 第1条爻辞
                    return "初九，壮于前趾，往不胜为咎。";
                case "1000002"://夬卦 第2条爻辞
                    return "九二，惕号，莫夜有戎，勿恤。";
                case "1000003"://夬卦 第3条爻辞
                    return "九三，壮于頄，有凶。君子夬夬独行，遇雨若濡，有愠，无咎。";
                case "1000004"://夬卦 第4条爻辞
                    return "九四，臀无肤，其行次且；牵羊悔亡，闻言不信。";
                case "1000005"://夬卦 第5条爻辞
                    return "九五，苋陆夬夬；中行无咎。";
                case "1000006"://夬卦 第6条爻辞
                    return "上六，无号，终有凶。";
                case "1000000"://夬卦 卦辞
                    return "夬，扬于王庭，孚号有厉；告自邑，不利即戎。利有攸往。";
                case "1000011"://大过卦 第1条爻辞
                    return "初六，藉用白茅，无咎。";
                case "1000012"://大过卦 第2条爻辞
                    return "九二，枯杨生秭，老夫得其女妻，无不利。";
                case "1000013"://大过卦 第3条爻辞
                    return "九三，栋桡，凶。";
                case "1000014"://大过卦 第4条爻辞
                    return "九四，栋隆，吉。有它，吝。";
                case "1000015"://大过卦 第5条爻辞
                    return "九五，枯杨生华，老妇得其士夫。无咎无誉。";
                case "1000016"://大过卦 第6条爻辞
                    return "上六，过涉灭顶。凶。无咎。";
                case "1000010"://大过卦 卦辞
                    return "大过，栋桡。利有攸往，亨。";
                case "1000101"://革卦 第1条爻辞
                    return "初九，巩用黄牛之革。";
                case "1000102"://革卦 第2条爻辞
                    return "六二，巳日乃革之，征吉，无咎。";
                case "1000103"://革卦 第3条爻辞
                    return "九三，征凶，贞厉；革言三就，有孚。";
                case "1000104"://革卦 第4条爻辞
                    return "九四，悔亡，有孚改命，吉。";
                case "1000105"://革卦 第5条爻辞
                    return "九五，大人虎变，未占有孚。";
                case "1000106"://革卦 第6条爻辞
                    return "上六，君子豹变，小人革面；征凶，居贞吉。";
                case "1000100"://革卦 卦辞
                    return "革，己日，乃孚，元亨，利贞，悔亡。";
                case "1000111"://咸卦 第1条爻辞
                    return "初六，咸其拇。";
                case "1000112"://咸卦 第2条爻辞
                    return "六二，咸其腓，凶；居吉。";
                case "1000113"://咸卦 第3条爻辞
                    return "九三，咸其股，执其随，往吝。";
                case "1000114"://咸卦 第4条爻辞
                    return "九四，贞吉，悔亡；憧憧往来，朋从尔思。";
                case "1000115"://咸卦 第5条爻辞
                    return "九五，咸其脢，无悔。";
                case "1000116"://咸卦 第6条爻辞
                    return "上六，咸其辅、颊、舌。";
                case "1000110"://咸卦 卦辞
                    return "咸，亨，利贞；取女吉。";
                case "1001001"://兑卦 第1条爻辞
                    return "初九，和兑，吉。";
                case "1001002"://兑卦 第2条爻辞
                    return "九二，孚兑，吉，悔亡。";
                case "1001003"://兑卦 第3条爻辞
                    return "六三，来兑，凶。";
                case "1001004"://兑卦 第4条爻辞
                    return "九四，商兑，未宁；介疾有喜。";
                case "1001005"://兑卦 第5条爻辞
                    return "九五，孚于剥，有厉。";
                case "1001006"://兑卦 第6条爻辞
                    return "上六，引兑。";
                case "1001000"://兑卦 卦辞
                    return "兑，亨，利贞。";
                case "1001011"://困卦 第1条爻辞
                    return "初六，臀困于株木，入于幽谷，三岁不觌。";
                case "1001012"://困卦 第2条爻辞
                    return "九二，困于酒食，朱绂方来，利用享祀；征凶，无咎。";
                case "1001013"://困卦 第3条爻辞
                    return "六三，困于石，据于蒺藜；入于其宫，不见其妻，凶。";
                case "1001014"://困卦 第4条爻辞
                    return "九四，来徐徐，困于金车，吝，有终。";
                case "1001015"://困卦 第5条爻辞
                    return "九五，劓刖，困于赤绂；乃徐有说，利用祭祀。";
                case "1001016"://困卦 第6条爻辞
                    return "上六，困于葛藟，于臲兀危；曰动悔有悔，征吉。";
                case "1001010"://困卦 卦辞
                    return "困，亨，贞，大人吉，无咎；有言不信。";
                case "1001101"://随卦 第1条爻辞
                    return "初九，官有渝，贞吉；出门交有功。";
                case "1001102"://随卦 第2条爻辞
                    return "六二，系小子，失丈夫。";
                case "1001103"://随卦 第3条爻辞
                    return "六三，系丈夫，失小子；随有求得，利居贞。";
                case "1001104"://随卦 第4条爻辞
                    return "九四，随有获，贞凶；有孚在道，以明何咎。";
                case "1001105"://随卦 第5条爻辞
                    return "九五，孚于嘉，吉。";
                case "1001106"://随卦 第6条爻辞
                    return "上六，拘系之，乃从维之，王用亨于西山。";
                case "1001100"://随卦 卦辞
                    return "随，元，亨，利，贞，无咎。";
                case "1001111"://萃卦 第1条爻辞
                    return "初六，有孚不终，乃乱乃萃；若号，一握为笑；勿恤，往无咎。";
                case "1001112"://萃卦 第2条爻辞
                    return "六二，引吉，无咎；孚乃利用禴。";
                case "1001113"://萃卦 第3条爻辞
                    return "六三，萃如嗟如，无攸利；往无咎，小吝。";
                case "1001114"://萃卦 第4条爻辞
                    return "九四，大吉，无咎。";
                case "1001115"://萃卦 第5条爻辞
                    return "九五，萃有位，无咎；匪孚，元永贞，悔亡。";
                case "1001116"://萃卦 第6条爻辞
                    return "上六，赍咨涕洟，无咎。";
                case "1001110"://萃卦 卦辞
                    return "萃，亨，王叚于庙，利见大人，亨，利贞，用大生③吉，利有攸往。";
                case "1010001"://需卦 第1条爻辞
                    return "初九，需于郊，利用恒，无咎。";
                case "1010002"://需卦 第2条爻辞
                    return "九二，需于沙，小有言，终吉。";
                case "1010003"://需卦 第3条爻辞
                    return "九三，需于泥，致寇至。";
                case "1010004"://需卦 第4条爻辞
                    return "六四，需于血，出自穴。";
                case "1010005"://需卦 第5条爻辞
                    return "九五，需于酒食，贞吉。";
                case "1010006"://需卦 第6条爻辞
                    return "上六，入于穴，有不速之客三人来，敬之终吉。";
                case "1010000"://需卦 卦辞
                    return "需，有孚，光亨，贞吉，利涉大川。";
                case "1010011"://井卦 第1条爻辞
                    return "初六，井泥不食，旧井无禽。";
                case "1010012"://井卦 第2条爻辞
                    return "九二，井谷射鲋，瓮敝漏。";
                case "1010013"://井卦 第3条爻辞
                    return "九三，井渫不食，为我心恻；可用汲，王明并受其福。";
                case "1010014"://井卦 第4条爻辞
                    return "六四，井甃，无咎。";
                case "1010015"://井卦 第5条爻辞
                    return "九五，井冽，寒泉食。";
                case "1010016"://井卦 第6条爻辞
                    return "上六，井收，勿幕；有孚，元吉。";
                case "1010010"://井卦 卦辞
                    return "井：改邑不改井，无丧无得。往来井井，汔至，亦未繘井，羸其瓶，凶。";
                case "1010101"://既济卦 第1条爻辞
                    return "初九，曳其轮，濡其尾，无咎。";
                case "1010102"://既济卦 第2条爻辞
                    return "六二，妇丧其茀，勿逐，七日得。";
                case "1010103"://既济卦 第3条爻辞
                    return "九三，高宗伐鬼方，三年克之；小人勿用。";
                case "1010104"://既济卦 第4条爻辞
                    return "六四，繻有衣袽，终日戒。";
                case "1010105"://既济卦 第5条爻辞
                    return "九五，东邻杀牛，不如西邻之禴祭，实受其福。";
                case "1010106"://既济卦 第6条爻辞
                    return "上六，濡其首，厉。";
                case "1010100"://既济卦 卦辞
                    return "既济：亨，小利贞；初吉终乱。";
                case "1010111"://蹇卦 第1条爻辞
                    return "初六，往蹇，来誉。";
                case "1010112"://蹇卦 第2条爻辞
                    return "六二，王臣蹇蹇，匪躬之故。";
                case "1010113"://蹇卦 第3条爻辞
                    return "九三，往蹇，来反。";
                case "1010114"://蹇卦 第4条爻辞
                    return "六四，往蹇，来连。";
                case "1010115"://蹇卦 第5条爻辞
                    return "九五，大蹇，朋来。";
                case "1010116"://蹇卦 第6条爻辞
                    return "上六，往蹇，来硕；吉；利见大人。";
                case "1010110"://蹇卦 卦辞
                    return "蹇：利西南，不利东北。利见大人，贞吉。";
                case "1011001"://节卦 第1条爻辞
                    return "初九，不出户庭，无咎。";
                case "1011002"://节卦 第2条爻辞
                    return "九二，不出门庭，凶。";
                case "1011003"://节卦 第3条爻辞
                    return "六三，不节若，则嗟若；无咎。";
                case "1011004"://节卦 第4条爻辞
                    return "六四，安节，亨。";
                case "1011005"://节卦 第5条爻辞
                    return "九五，甘节，吉；往有尚。";
                case "1011006"://节卦 第6条爻辞
                    return "上六，苦节，贞凶；悔亡。";
                case "1011000"://节卦 卦辞
                    return "节：亨；苦节不可；贞。";
                case "1011011"://坎卦 第1条爻辞
                    return "初六，习坎，入于坎窞，凶。";
                case "1011012"://坎卦 第2条爻辞
                    return "九二，坎有险，求小得。";
                case "1011013"://坎卦 第3条爻辞
                    return "六三，来之坎，坎险且枕。入于坎窞，勿用。";
                case "1011014"://坎卦 第4条爻辞
                    return "六四，樽酒簋，贰用缶，纳约自牖，终无咎。";
                case "1011015"://坎卦 第5条爻辞
                    return "九五，坎不盈，祗既平，无咎。";
                case "1011016"://坎卦 第6条爻辞
                    return "上六，系用徽纆，寘于丛棘上，三岁不得，凶。";
                case "1011010"://坎卦 卦辞
                    return "坎：习坎。有孚维心，亨，行有尚。";
                case "1011101"://屯卦 第1条爻辞
                    return "初九，磐桓，利居贞，利建侯。";
                case "1011102"://屯卦 第2条爻辞
                    return "六二，屯如，邅如，乘马班如。匪寇，婚媾。女子贞不字，十年乃字。";
                case "1011103"://屯卦 第3条爻辞
                    return "六三，即鹿无虞，惟入于林中；君子几不如舍。往吝。";
                case "1011104"://屯卦 第4条爻辞
                    return "六四，乘马班如，求婚媾；往吉，无不利。";
                case "1011105"://屯卦 第5条爻辞
                    return "九五，屯其膏，小贞吉，大贞凶。";
                case "1011106"://屯卦 第6条爻辞
                    return "上六，乘马班如，泣血涟如。";
                case "1011100"://屯卦 卦辞
                    return "屯：元亨，利贞，勿用有攸往。利建侯。";
                case "1011111"://比卦 第1条爻辞
                    return "初六，有孚比之，无咎。有孚盈缶，终来有它，吉。";
                case "1011112"://比卦 第2条爻辞
                    return "六二，比之自内，贞吉。";
                case "1011113"://比卦 第3条爻辞
                    return "六三，比之匪人。";
                case "1011114"://比卦 第4条爻辞
                    return "六四，外比之，贞吉。";
                case "1011115"://比卦 第5条爻辞
                    return "九五，显比，王用三驱，失前禽，邑人不诫，吉。";
                case "1011116"://比卦 第6条爻辞
                    return "上六，比之无首，凶。";
                case "1011110"://比卦 卦辞
                    return "比：吉。原筮，元永贞，无咎。不宁方来。后夫凶。";
                case "1100001"://大壮卦 第1条爻辞
                    return "初九，壮于趾，征凶，有孚。";
                case "1100002"://大壮卦 第2条爻辞
                    return "九二，贞吉。";
                case "1100003"://大壮卦 第3条爻辞
                    return "九三，小人用壮，君子用亡。贞厉。羝羊触藩，羸其角。";
                case "1100004"://大壮卦 第4条爻辞
                    return "九四，贞吉，悔亡；藩决不羸，壮于大舆之輹。";
                case "1100005"://大壮卦 第5条爻辞
                    return "六五，丧羊于易，无悔。";
                case "1100006"://大壮卦 第6条爻辞
                    return "上六，羝羊触藩，不能退，不能遂，无攸利；艰则吉。";
                case "1100000"://大壮卦 卦辞
                    return "大壮：利贞。";
                case "1100011"://恒卦 第1条爻辞
                    return "初六，浚恒，贞凶，无攸利。";
                case "1100012"://恒卦 第2条爻辞
                    return "九二，悔亡。";
                case "1100013"://恒卦 第3条爻辞
                    return "九三，不恒其德，或承之羞，贞吝。";
                case "1100014"://恒卦 第4条爻辞
                    return "九四，田无禽。";
                case "1100015"://恒卦 第5条爻辞
                    return "六五，恒其德，贞；妇人吉，夫子凶。";
                case "1100016"://恒卦 第6条爻辞
                    return "上六，振恒，凶。";
                case "1100010"://恒卦 卦辞
                    return "恒：亨，无咎。利贞，利有攸往。";
                case "1100101"://丰卦 第1条爻辞
                    return "初九，遇其配主，虽旬无咎；往有尚。";
                case "1100102"://丰卦 第2条爻辞
                    return "六二，丰其蔀，日中见斗，往得疑疾；有孚发若，吉。";
                case "1100103"://丰卦 第3条爻辞
                    return "九三，丰其沛，日中见沬；折其右肱，吉。";
                case "1100104"://丰卦 第4条爻辞
                    return "九四，丰其蔀，日中见斗；遇其夷主，吉。";
                case "1100105"://丰卦 第5条爻辞
                    return "六五，来章，有庆誉，吉。";
                case "1100106"://丰卦 第6条爻辞
                    return "上六，丰其屋，蔀其家，窥其户，阒其无人，三岁不觌，凶。";
                case "1100100"://丰卦 卦辞
                    return "丰：亨。王假之，勿忧，宜日中。";
                case "1100111"://小过卦 第1条爻辞
                    return "初六，飞鸟以凶。";
                case "1100112"://小过卦 第2条爻辞
                    return "六二，过其祖，遇其妣；不及其君，遇其臣，无咎。";
                case "1100113"://小过卦 第3条爻辞
                    return "九三，弗过防之；从或戕之，凶。";
                case "1100114"://小过卦 第4条爻辞
                    return "九四，无咎，弗过遇之；往厉，必戒；勿用，永贞。";
                case "1100115"://小过卦 第5条爻辞
                    return "六五，密云不雨，自我西郊；公弋取彼在穴。";
                case "1100116"://小过卦 第6条爻辞
                    return "上六，弗遇过之，飞鸟离之，凶；是谓灾眚。";
                case "1100110"://小过卦 卦辞
                    return "小过：亨利贞。可小事，不可大事。飞鸟遗之音：不宜上，宜下。大吉。";
                case "1101001"://归妹卦 第1条爻辞
                    return "初九，归妹以娣，跛能履，征吉。";
                case "1101002"://归妹卦 第2条爻辞
                    return "九二，眇能视，利幽人之贞。";
                case "1101003"://归妹卦 第3条爻辞
                    return "六三，归妹以须，反归于娣。";
                case "1101004"://归妹卦 第4条爻辞
                    return "九四，归妹愆期，迟归有时。";
                case "1101005"://归妹卦 第5条爻辞
                    return "六五，帝乙归妹，其君之袂不如其娣之袂良；月几望，吉。";
                case "1101006"://归妹卦 第6条爻辞
                    return "上六，女承筐，无实；士刲羊，无血，无攸利。";
                case "1101000"://归妹卦 卦辞
                    return "归妹：征凶，无攸利。";
                case "1101011"://解卦 第1条爻辞
                    return "初六，无咎。";
                case "1101012"://解卦 第2条爻辞
                    return "九二，田获三狐，得黄矢。贞吉。";
                case "1101013"://解卦 第3条爻辞
                    return "六三，负且乘，致寇至。贞吝。";
                case "1101014"://解卦 第4条爻辞
                    return " 九四，解而拇，朋至斯罕。";
                case "1101015"://解卦 第5条爻辞
                    return "六五，君子维有解，吉。有翠于小人。";
                case "1101016"://解卦 第6条爻辞
                    return "上六，公用射隼于高墉之上，获之，无不利。";
                case "1101010"://解卦 卦辞
                    return "解：利西南。无所往，其来复，吉。有攸往，夙吉。";
                case "1101101"://震卦 第1条爻辞
                    return "初九，震来虩虩，后，笑言哑哑，吉。";
                case "1101102"://震卦 第2条爻辞
                    return "六二，震来，厉，亿丧贝；跻于九陵，勿逐，七日得。";
                case "1101103"://震卦 第3条爻辞
                    return "六三，震苏苏，震行无眚。";
                case "1101104"://震卦 第4条爻辞
                    return "九四，震遂泥。";
                case "1101105"://震卦 第5条爻辞
                    return "六五，震往来，厉；亿无丧，有事。";
                case "1101106"://震卦 第6条爻辞
                    return "上六，震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾，有言。";
                case "1101100"://震卦 卦辞
                    return "震：亨；震来虩虩，笑言哑哑；震惊百里，不丧匕鬯。";
                case "1101111"://豫卦 第1条爻辞
                    return "初六，鸣豫，凶。";
                case "1101112"://豫卦 第2条爻辞
                    return "六二，介于石，不终日，贞吉。";
                case "1101113"://豫卦 第3条爻辞
                    return "六三，盱豫，悔。 迟有悔。";
                case "1101114"://豫卦 第4条爻辞
                    return "九四，由豫，大有得。勿疑。 朋盍簪。";
                case "1101115"://豫卦 第5条爻辞
                    return "六五，贞疾，恒不死。";
                case "1101116"://豫卦 第6条爻辞
                    return "上六，冥豫，成有渝，无咎。";
                case "1101110"://豫卦 卦辞
                    return "豫：利建侯、行师。";
                case "1110001"://泰卦 第1条爻辞
                    return "初九，拔茅茹，以其汇，征吉。";
                case "1110002"://泰卦 第2条爻辞
                    return "九二，包荒，用冯河，不遐遗；朋亡，得尚于中行。";
                case "1110003"://泰卦 第3条爻辞
                    return "九三，无平不陂，无往不复；艰贞无咎，勿恤其孚，于食有福。";
                case "1110004"://泰卦 第4条爻辞
                    return "六四，翩翩，不富以其邻，不戒以孚。";
                case "1110005"://泰卦 第5条爻辞
                    return "六五，帝乙归妹，以祉元吉。";
                case "1110006"://泰卦 第6条爻辞
                    return "上六，“城复于隍”；勿用师，自邑告命，贞吝。";
                case "1110000"://泰卦 卦辞
                    return "泰：小往大来，吉，亨。";
                case "1110011"://升卦 第1条爻辞
                    return "初六，允升，大吉。";
                case "1110012"://升卦 第2条爻辞
                    return "九二，孚，乃利用禴，无咎。";
                case "1110013"://升卦 第3条爻辞
                    return "九三，升虚邑。";
                case "1110014"://升卦 第4条爻辞
                    return "六四，王用亨于岐山，吉，无咎。";
                case "1110015"://升卦 第5条爻辞
                    return "六五，贞吉，升阶。";
                case "1110016"://升卦 第6条爻辞
                    return "上六，冥升，利于不息之贞。";
                case "1110010"://升卦 卦辞
                    return "升：元亨，用见大人；勿恤；南征吉。";
                case "1110101"://明夷卦 第1条爻辞
                    return "初九，明夷于飞，垂其翼；君子之行，三日不食。有攸往，主人有言。";
                case "1110102"://明夷卦 第2条爻辞
                    return "六二，明夷，夷于左腹，用拯马壮，吉。";
                case "1110103"://明夷卦 第3条爻辞
                    return "九三，明夷于南狩，得其大首；不可疾，贞。";
                case "1110104"://明夷卦 第4条爻辞
                    return "六四，入于左腹，获明夷之心，于出门庭。";
                case "1110105"://明夷卦 第5条爻辞
                    return "六五，箕子之明夷，利贞。";
                case "1110106"://明夷卦 第6条爻辞
                    return "上六，不明晦，初登于天，后入于地。";
                case "1110100"://明夷卦 卦辞
                    return "明夷：利艰贞。";
                case "1110111"://谦卦 第1条爻辞
                    return "初六，谦谦君子，用涉大川，吉。";
                case "1110112"://谦卦 第2条爻辞
                    return "六二，鸣谦，贞吉。";
                case "1110113"://谦卦 第3条爻辞
                    return "九三，劳谦，君子有终，吉。";
                case "1110114"://谦卦 第4条爻辞
                    return "六四，无不利，撝谦。";
                case "1110115"://谦卦 第5条爻辞
                    return "六五，不富，以其邻，利用侵伐，无不利。";
                case "1110116"://谦卦 第6条爻辞
                    return "上六，鸣谦，利用行师，征邑国。";
                case "1110110"://谦卦 卦辞
                    return "谦：亨，君子有终。";
                case "1111001"://临卦 第1条爻辞
                    return "初九，咸临，贞吉。";
                case "1111002"://临卦 第2条爻辞
                    return "九二，咸临，吉，无不利。";
                case "1111003"://临卦 第3条爻辞
                    return "六三，甘临，无攸利。既忧之，无咎。";
                case "1111004"://临卦 第4条爻辞
                    return "六四，至临，无咎。";
                case "1111005"://临卦 第5条爻辞
                    return "六五，知临，大君之宜，吉。";
                case "1111006"://临卦 第6条爻辞
                    return "上六，敦临，吉，无咎。";
                case "1111000"://临卦 卦辞
                    return "临：元、亨、利、贞，至于八月有凶。";
                case "1111011"://师卦 第1条爻辞
                    return "初六，师出以律，否臧凶。";
                case "1111012"://师卦 第2条爻辞
                    return "九二，在师中，吉，无咎；王三锡命。";
                case "1111013"://师卦 第3条爻辞
                    return "六三，师或舆尸，凶。";
                case "1111014"://师卦 第4条爻辞
                    return "六四，师左次，无咎。";
                case "1111015"://师卦 第5条爻辞
                    return "六五，田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。";
                case "1111016"://师卦 第6条爻辞
                    return "上六，大君有命，开国承家，小人勿用。";
                case "1111010"://师卦 卦辞
                    return "师：贞，丈人吉，无咎。";
                case "1111101"://复卦 第1条爻辞
                    return "初九，不远复，无祗悔，元吉。";
                case "1111102"://复卦 第2条爻辞
                    return "六二，休复，吉。";
                case "1111103"://复卦 第3条爻辞
                    return "六三，频复，厉，无咎。";
                case "1111104"://复卦 第4条爻辞
                    return "六四，中行独复。";
                case "1111105"://复卦 第5条爻辞
                    return "六五，敦复，无悔。";
                case "1111106"://复卦 第6条爻辞
                    return "上六，迷复，凶、有灾眚。用行师，终有大败；以其国，君凶，至于十年不克征";
                case "1111100"://复卦 卦辞
                    return "复：亨。出入无疾，朋来无咎；反复其道，七日来复，利有攸往。";
                case "1111111"://坤卦 第1条爻辞
                    return "初六，履霜，坚冰至。";
                case "1111112"://坤卦 第2条爻辞
                    return "六二，直方大，不习无不利。";
                case "1111113"://坤卦 第3条爻辞
                    return "六三，含章可贞，或从王事，无成有终。";
                case "1111114"://坤卦 第4条爻辞
                    return "六四，括囊，无咎无誉。";
                case "1111115"://坤卦 第5条爻辞
                    return "六五，黄裳，元吉。";
                case "1111116"://坤卦 第6条爻辞
                    return "上六，龙战于野，其血玄黄。";
                case "1111110"://坤卦 卦辞
                    return "坤：元、亨，利牝马之贞。君子有攸往，先迷，后得主，利。西南得朋，东北丧朋。安贞吉。";
                default:
                    return "";
            }
        }
    }
}
